statistics.json
{
  "security_checking http request successful...-0" : {
    "transaction" : "security_checking http request successful...-0",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.3639999999999997,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 48.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 11.990000000000009,
    "throughput" : 33.99163805703797,
    "receivedKBytesPerSec" : 17.062208946599135,
    "sentKBytesPerSec" : 6.10787246337401
  },
  "security_checking http request successful...-1" : {
    "transaction" : "security_checking http request successful...-1",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.2699999999999982,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 34.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 9.0,
    "throughput" : 33.99279352777211,
    "receivedKBytesPerSec" : 74.3592358420015,
    "sentKBytesPerSec" : 4.879824852131348
  },
  "Transfer GET request successful...-0" : {
    "transaction" : "Transfer GET request successful...-0",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.734000000000007,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 100.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 13.0,
    "pct3ResTime" : 36.960000000000036,
    "throughput" : 34.00897837028976,
    "receivedKBytesPerSec" : 23.248325057815265,
    "sentKBytesPerSec" : 5.812081264453816
  },
  "Admin Logout http request successful...-0" : {
    "transaction" : "Admin Logout http request successful...-0",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.831000000000001,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 20.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 8.990000000000009,
    "throughput" : 33.99857205997348,
    "receivedKBytesPerSec" : 19.190600244789717,
    "sentKBytesPerSec" : 4.747847465406453
  },
  "Account Creation http GET request successful..." : {
    "transaction" : "Account Creation http GET request successful...",
    "sampleCount" : 1000,
    "errorCount" : 1000,
    "errorPct" : 100.0,
    "meanResTime" : 0.8029999999999988,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 28.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 6.0,
    "throughput" : 34.00088402298459,
    "receivedKBytesPerSec" : 42.46790104042705,
    "sentKBytesPerSec" : 4.9805982455543845
  },
  "Transfer GET request successful...-1" : {
    "transaction" : "Transfer GET request successful...-1",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.3129999999999984,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 28.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 8.980000000000018,
    "throughput" : 34.01129174886062,
    "receivedKBytesPerSec" : 264.6503639208217,
    "sentKBytesPerSec" : 6.410331355009863
  },
  "Logout http request successful...-1" : {
    "transaction" : "Logout http request successful...-1",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.2930000000000001,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 28.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 8.0,
    "throughput" : 33.9951047049225,
    "receivedKBytesPerSec" : 264.5244084851781,
    "sentKBytesPerSec" : 5.610520210089747
  },
  "Admin Logout http request successful..." : {
    "transaction" : "Admin Logout http request successful...",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.416,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 57.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 9.0,
    "pct3ResTime" : 20.99000000000001,
    "throughput" : 33.9951047049225,
    "receivedKBytesPerSec" : 110.6168836687517,
    "sentKBytesPerSec" : 15.736015263802011
  },
  "Transfer GET request successful..." : {
    "transaction" : "Transfer GET request successful...",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.130000000000006,
    "medianResTime" : 3.0,
    "minResTime" : 2.0,
    "maxResTime" : 103.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 17.0,
    "pct3ResTime" : 43.0,
    "throughput" : 34.007821799013776,
    "receivedKBytesPerSec" : 287.87089780649546,
    "sentKBytesPerSec" : 12.221560959020573
  },
  "security_checking http request successful..." : {
    "transaction" : "security_checking http request successful...",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.6980000000000026,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 52.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 16.0,
    "throughput" : 33.99048266485384,
    "receivedKBytesPerSec" : 91.41580982324949,
    "sentKBytesPerSec" : 10.987157970768184
  },
  "Logout http request successful...-0" : {
    "transaction" : "Logout http request successful...-0",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.8129999999999994,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 24.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 8.0,
    "throughput" : 33.99394907706428,
    "receivedKBytesPerSec" : 18.192074310772682,
    "sentKBytesPerSec" : 4.5480185776931705
  },
  "Admin Logout http request successful...-2" : {
    "transaction" : "Admin Logout http request successful...-2",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.2610000000000015,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 38.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 9.0,
    "throughput" : 33.99857205997348,
    "receivedKBytesPerSec" : 74.371876381192,
    "sentKBytesPerSec" : 4.880654387515724
  },
  "deposit http POST request successful..." : {
    "transaction" : "deposit http POST request successful...",
    "sampleCount" : 1000,
    "errorCount" : 1000,
    "errorPct" : 100.0,
    "meanResTime" : 2.694000000000003,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 42.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 14.0,
    "throughput" : 34.00088402298459,
    "receivedKBytesPerSec" : 34.731371765665905,
    "sentKBytesPerSec" : 7.570509333242664
  },
  "Admin Logout http request successful...-1" : {
    "transaction" : "Admin Logout http request successful...-1",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.178999999999999,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 19.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 10.980000000000018,
    "throughput" : 33.99857205997348,
    "receivedKBytesPerSec" : 17.065689491041375,
    "sentKBytesPerSec" : 6.109118417026485
  },
  "Home access http request successful...-1" : {
    "transaction" : "Home access http request successful...-1",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.3799999999999983,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 48.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 11.0,
    "throughput" : 33.98701695952146,
    "receivedKBytesPerSec" : 264.4614757162764,
    "sentKBytesPerSec" : 6.405756126159807
  },
  "Home access http request successful...-0" : {
    "transaction" : "Home access http request successful...-0",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.9700000000000008,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 29.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.949999999999932,
    "pct3ResTime" : 7.0,
    "throughput" : 33.98586188145732,
    "receivedKBytesPerSec" : 23.23252277052746,
    "sentKBytesPerSec" : 4.480557962887439
  },
  "Login http request successful..." : {
    "transaction" : "Login http request successful...",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.299999999999999,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 21.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 8.0,
    "throughput" : 33.98932735121172,
    "receivedKBytesPerSec" : 264.4794534516162,
    "sentKBytesPerSec" : 6.406191580843616
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 23000,
    "errorCount" : 2000,
    "errorPct" : 8.695652,
    "meanResTime" : 1.8655217391304368,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 103.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 7.0,
    "throughput" : 779.2647806200237,
    "receivedKBytesPerSec" : 3283.850637387769,
    "sentKBytesPerSec" : 167.61868964933083
  },
  "Profile GET request successful...-1" : {
    "transaction" : "Profile GET request successful...-1",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.293999999999999,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 20.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 9.0,
    "throughput" : 34.014762406884586,
    "receivedKBytesPerSec" : 264.6773699785707,
    "sentKBytesPerSec" : 5.9127223715092345
  },
  "Logout http request successful..." : {
    "transaction" : "Logout http request successful...",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.1770000000000023,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 35.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 15.0,
    "throughput" : 33.99279352777211,
    "receivedKBytesPerSec" : 282.69788054932354,
    "sentKBytesPerSec" : 10.158002753416277
  },
  "index http request successful..." : {
    "transaction" : "index http request successful...",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.5039999999999962,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 71.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 12.0,
    "throughput" : 33.90060343074107,
    "receivedKBytesPerSec" : 263.78907044545394,
    "sentKBytesPerSec" : 4.336893602956132
  },
  "Home access http request successful..." : {
    "transaction" : "Home access http request successful...",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.429,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 49.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 20.99000000000001,
    "throughput" : 33.98470688190314,
    "receivedKBytesPerSec" : 287.6752336448598,
    "sentKBytesPerSec" : 10.8857264231096
  },
  "Profile GET request successful...-0" : {
    "transaction" : "Profile GET request successful...-0",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.3430000000000013,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 31.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 12.990000000000009,
    "throughput" : 34.01244855617156,
    "receivedKBytesPerSec" : 19.530585694364138,
    "sentKBytesPerSec" : 6.543410513247848
  },
  "Profile GET request successful..." : {
    "transaction" : "Profile GET request successful...",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.710999999999995,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 35.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 19.99000000000001,
    "throughput" : 34.01129174886062,
    "receivedKBytesPerSec" : 284.18028535473775,
    "sentKBytesPerSec" : 12.455307036936263
  }
}